// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Новая процедура.
// 
// Параметры:
//  Параметр - см. Документы.ПродажаБилета.Билет.Ссылка
Процедура НоваяПроцедура(Параметр) Экспорт
	НоваяПеременная = 1; // см. Документы.ПродажаБилета.Билет.Ссылка
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
